import numpy as np
import pandas as pd
import pytest
from pandas import DataFrame


@pytest.fixture
def sorted_df() -> DataFrame:
    return pd.DataFrame(
        {
            "Номер карты": ["*5750", "*6789"],
            "Сумма операции с округлением": [1000, 2000],
            "Дата платежа": ["01.01.2023", "15.01.2023"],
            "Дата операции": ["01.01.2023", "15.01.2023"],
            "Сумма операции": [-1000, -2000],
            "Категория": ["Еда", "Транспорт"],
            "Кэшбэк": [np.nan, np.nan],
            "Описание": ["Магнит", "РЖД"],
        }
    )


@pytest.fixture
def sort_df() -> DataFrame:
    return pd.DataFrame(
        {
            "Номер карты": ["*5750", "*6789"],
            "Сумма операции с округлением": [1000, 2000],
            "Дата операции": ["01.01.2023", "15.01.2023"],
            "Дата платежа": ["01.01.2023", "15.01.2023"],
            "Сумма операции": [1000, 2000],
            "Категория": ["Еда", "Транспорт"],
            "Кэшбэк": [np.nan, np.nan],
        }
    )


@pytest.fixture
def reports_df() -> DataFrame:
    return pd.DataFrame(
        {
            "Номер карты": ["*5750", "*6789"],
            "Сумма операции с округлением": [1000, 2000],
            "Дата платежа": ["01.01.2023", "15.01.2023"],
            "Дата операции": ["2023-01-01 16:14:10", "2025-10-10 15:20:21"],
            "Сумма операции": [-1000, -2000],
            "Категория": ["Еда", "Транспорт"],
            "Кэшбэк": [np.nan, np.nan],
            "Описание": ["Магнит", "РЖД"],
        }
    )
